Reports/ВедомостьРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ВедомостьРеализации</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьРучнуюСкидкуКБазовойСумме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчитатьПоВсейНоменклатуре</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодПоДатеЗаказа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СкидкиНаценкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СкидкиНаценкиНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОграничениеСкидкиНаценки</Name>
					<Comment>(Общ) Окраничение скидки, наценки.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Качество</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Условие</Name>
					<Comment>(Общ) Условие скидки-наценки</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УсловияСкидкиНаценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеУсловия</Name>
					<Comment>(Общ) Значение условия скидки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыОплатЧекаККМ</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДисконтныхКарт</v8:Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательСкидки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РекламныйРасход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РекламныйРасход</Name>
			<Comment>Расход рекламных кабинетов по дням; наполняется загрузкой с сайта</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Кампания</Name>
					<Comment>Пустая = расход канала без разбивки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеКампании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Comment>Как в реквизите referrer заказа: "utm_source utm_campaign"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Расход в гривнах по курсу НБУ на день расхода</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ГруппыХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ГруппыХарактеристик</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РаспаковатьРостовок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИгнорироватьНоль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОсновная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПошиваНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПошиваКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Характеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТипыЦенНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТипыЦенНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаЦены</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйТипЦен</Name>
					<Comment>(Общ) Тип цен, от которого рассчитываются цены данного типа, если не выбран, то цены задаются вручную</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рассчитывается</Name>
					<Comment>(Общ) Истина - цены автоматически рассчитываются (не хранятся) на основании цен базового типа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Comment>(Общ) Истина - цена включает НДС, ложь - не включает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокОкругления</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкруглятьВБольшуюСторону</Name>
					<Comment>(Общ) Истина, то при порядке округления "5" 0.01 будет округлена до 5, ложь - округление по арифметическим правилам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПрименятьУточняющийПроцент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ВедомостьРеализации/Ext/ObjectModule.bsl
#Если Клиент Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ НАЧАЛЬНОЙ НАСТРОЙКИ ОТЧЕТА

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры = Неопределено)
	
	// Дополнительные параметры, переданные из отчета, вызвавшего расшифровку.
	// Информация, передаваемая в переменной ДополнительныеПараметры, может быть использована
	// для реализации специфичных для данного отчета параметрических настроек.
	// Описание исходного текста запроса.
	

		Запрос = Новый Запрос;
		ТекстЗапроса = 
		
				"ВЫБРАТЬ
				|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика,
				|	ВЫБОР
				|		КОГДА основная.Ссылка ЕСТЬ NULL
				|			ТОГДА неосновная.Ссылка
				|		ИНАЧЕ основная.Ссылка
				|	КОНЕЦ КАК Ростовка,
				|	ХарактеристикиНоменклатуры.Владелец КАК Владелец
				|ПОМЕСТИТЬ ВТРостовка
				|ИЗ
				|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
				|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МАКСИМУМ(ГруппыХарактеристикХарактеристики.Ссылка) КАК Ссылка,
				|			ГруппыХарактеристикХарактеристики.Характеристика КАК Характеристика
				|		ИЗ
				|			Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
				|		ГДЕ
				|			ГруппыХарактеристикХарактеристики.Ссылка.НеОсновная
				|		
				|		СГРУППИРОВАТЬ ПО
				|			ГруппыХарактеристикХарактеристики.Характеристика) КАК неосновная
	 			|		ПО ХарактеристикиНоменклатуры.Ссылка = неосновная.Характеристика
				|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МАКСИМУМ(ГруппыХарактеристикХарактеристики.Ссылка) КАК Ссылка,
				|			ГруппыХарактеристикХарактеристики.Характеристика КАК Характеристика
				|		ИЗ
				|			Справочник.ГруппыХарактеристик.Характеристики КАК ГруппыХарактеристикХарактеристики
				|		ГДЕ
				|			НЕ ГруппыХарактеристикХарактеристики.Ссылка.НеОсновная
				|		
				|		СГРУППИРОВАТЬ ПО
				|			ГруппыХарактеристикХарактеристики.Характеристика) КАК основная
				|		ПО ХарактеристикиНоменклатуры.Ссылка = основная.Характеристика
				|ГДЕ
				|	ХарактеристикиНоменклатуры.Владелец.ВидНоменклатуры.Код В (""000000010"", ""000000001"")
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	РеализацияТоваровУслугТовары.Ссылка КАК Документ,
				|	РеализацияТоваровУслугТовары.Ссылка.Контрагент КАК Контрагент,
				|	РеализацияТоваровУслугТовары.Номенклатура КАК Номенклатура,
				|	РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	РеализацияТоваровУслугТовары.Количество КАК Количество,
				|	РеализацияТоваровУслугТовары.Сумма КАК СуммаПродажи,
				|	ПолучимЦену.Цена * РеализацияТоваровУслугТовары.Количество * (1 - (ЕСТЬNULL(ВЫБОР
				|			КОГДА &ПрименятьРучнуюСкидку
				|				ТОГДА РеализацияТоваровУслугТовары.ПроцентСкидкиНаценки
				|			ИНАЧЕ 0
				|		КОНЕЦ, 0) + ВЫБОР
				|		КОГДА ЕСТЬNULL(ПолучимСкидку.ПроцентСкидкиНаценки, 0) = 0
				|				И ЕСТЬNULL(РеализацияТоваровУслугТовары.ПроцентАвтоматическихСкидок, 0) > 0
				|			ТОГДА ЕСТЬNULL(РеализацияТоваровУслугТовары.ПроцентАвтоматическихСкидок, 0)
				|		ИНАЧЕ ЕСТЬNULL(ПолучимСкидку.ПроцентСкидкиНаценки, 0)
				|	КОНЕЦ) / 100) КАК СуммаБазовая,
				|	РеализацияТоваровУслугТовары.Сумма - ПолучимЦену.Цена * РеализацияТоваровУслугТовары.Количество * (1 - (ЕСТЬNULL(ВЫБОР
				|			КОГДА &ПрименятьРучнуюСкидку
				|				ТОГДА РеализацияТоваровУслугТовары.ПроцентСкидкиНаценки
				|			ИНАЧЕ 0
				|		КОНЕЦ, 0) + ВЫБОР
				|		КОГДА ЕСТЬNULL(ПолучимСкидку.ПроцентСкидкиНаценки, 0) = 0
				|				И ЕСТЬNULL(РеализацияТоваровУслугТовары.ПроцентАвтоматическихСкидок, 0) > 0
				|			ТОГДА ЕСТЬNULL(РеализацияТоваровУслугТовары.ПроцентАвтоматическихСкидок, 0)
				|		ИНАЧЕ ЕСТЬNULL(ПолучимСкидку.ПроцентСкидкиНаценки, 0)
				|	КОНЕЦ) / 100) КАК Розница,
				|	ВЫБОР
				|		КОГДА РеализацияТоваровУслугТовары.Ссылка.Контрагент.Код = ""000004317""
				|			ТОГДА ВЫБОР
				|					КОГДА РеализацияТоваровУслугТовары.Сумма > 2000
				|						ТОГДА 0.15 * РеализацияТоваровУслугТовары.Сумма
				|					ИНАЧЕ 0.2 * РеализацияТоваровУслугТовары.Сумма
				|				КОНЕЦ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА НЕ РеализацияТоваровУслугТовары.Ссылка.Контрагент.комиссия = 0
				|					ТОГДА РеализацияТоваровУслугТовары.Ссылка.Контрагент.комиссия / 100 * РеализацияТоваровУслугТовары.Сумма
				|				ИНАЧЕ 0
				|			КОНЕЦ
				|	КОНЕЦ КАК Комиссия,
				|	ПолучимПервуюЦену.Цена КАК Цена,
				|	РеализацияТоваровУслугТовары.ЗаказПокупателя КАК ЗаказПокупателя,
				|	0 КАК Реклама,
				|	РеализацияТоваровУслугТовары.ЗаказПокупателя.referrer КАК КлючИсточника,
				|	ЗНАЧЕНИЕ(Справочник.РекламныеКампании.ПустаяСсылка) КАК РекламнаяКампания
				|ПОМЕСТИТЬ Общ
				|ИЗ
				|	Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период,
				|			ЦеныНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|			РеализацияТоваровУслугТовары.Ссылка КАК Реализация,
				|			РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки
				|		ИЗ
				|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				|				ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
				|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
				|					ПО ЦеныНоменклатуры.ТипЦен = ТипыЦенНоменклатуры.Ссылка
				|				ПО РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры
				|					И (ВЫБОР
				|						КОГДА РеализацияТоваровУслугТовары.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
				|							ТОГДА РеализацияТоваровУслугТовары.Ссылка.Дата
				|						ИНАЧЕ РеализацияТоваровУслугТовары.ЗаказПокупателя.Дата
				|					КОНЕЦ >= ЦеныНоменклатуры.Период)
				|		ГДЕ
				|			ТипыЦенНоменклатуры.Код = ""000000001""
				|		
				|		СГРУППИРОВАТЬ ПО
				|			ЦеныНоменклатуры.ХарактеристикаНоменклатуры,
				|			РеализацияТоваровУслугТовары.Ссылка,
				|			РеализацияТоваровУслугТовары.НомерСтроки) КАК ПолучимПериодЦены
				|			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|				ПолучимЦену.ХарактеристикаНоменклатуры КАК Характеристики,
				|				ПолучимЦену.Цена КАК Цена,
				|				ПолучимЦену.Период КАК Период
				|			ИЗ
				|				РегистрСведений.ЦеныНоменклатуры КАК ПолучимЦену
				|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
				|					ПО ПолучимЦену.ТипЦен = ТипыЦенНоменклатуры.Ссылка
				|			ГДЕ
				|				ТипыЦенНоменклатуры.Ссылка = &БазовыйТипЦен) КАК ПолучимЦену
				|			ПО ПолучимПериодЦены.ХарактеристикаНоменклатуры = ПолучимЦену.Характеристики
				|				И ПолучимПериодЦены.Период = ПолучимЦену.Период
				|		ПО РеализацияТоваровУслугТовары.Ссылка = ПолучимПериодЦены.Реализация
				|			И РеализацияТоваровУслугТовары.НомерСтроки = ПолучимПериодЦены.НомерСтроки
				|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			РеализацияТоваровУслугТовары.Ссылка КАК Реализация,
				|			МАКСИМУМ(СкидкиНаценкиНоменклатуры.Период) КАК Период,
				|			РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
				|			СкидкиНаценкиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
				|		ИЗ
				|			Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
				|				ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры
				|				ПО РеализацияТоваровУслугТовары.ЗаказПокупателя.Дата >= СкидкиНаценкиНоменклатуры.Период
				|					И (СкидкиНаценкиНоменклатуры.ХарактеристикаНоменклатуры В
				|						(ВЫБРАТЬ
				|							ПолучимХарактеристикуНк.Ссылка КАК ХарактеристикаНк
				|						ИЗ
				|							Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
				|								ЛЕВОЕ СОЕДИНЕНИЕ ВТРостовка КАК ВТРостовка
				|									ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ПолучимХарактеристикуНк
				|									ПО
				|										ВТРостовка.Ростовка.Наименование = ПолучимХарактеристикуНк.Наименование
				|											И ВТРостовка.Характеристика.Владелец.Код = ПолучимХарактеристикуНк.Владелец.Нк
				|								ПО
				|									ХарактеристикиНоменклатуры.Ссылка = ВТРостовка.Характеристика
				|						ГДЕ
				|							ХарактеристикиНоменклатуры.Ссылка = РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры))
				|		
				|		СГРУППИРОВАТЬ ПО
				|			РеализацияТоваровУслугТовары.НомерСтроки,
				|			РеализацияТоваровУслугТовары.Ссылка,
				|			СкидкиНаценкиНоменклатуры.ХарактеристикаНоменклатуры) КАК ПолучимПериодСкидки
				|			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|				СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
				|				СкидкиНаценкиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|				СкидкиНаценкиНоменклатуры.Период КАК Период
				|			ИЗ
				|				РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры) КАК ПолучимСкидку
				|			ПО ПолучимПериодСкидки.Период = ПолучимСкидку.Период
				|				И ПолучимПериодСкидки.ХарактеристикаНоменклатуры = ПолучимСкидку.ХарактеристикаНоменклатуры
				|		ПО РеализацияТоваровУслугТовары.Ссылка = ПолучимПериодСкидки.Реализация
				|			И РеализацияТоваровУслугТовары.НомерСтроки = ПолучимПериодСкидки.НомерСтроки
				|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			ЦеныНоменклатурыСрезПервых.Цена КАК Цена,
				|			ЦеныНоменклатурыСрезПервых.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
				|		ИЗ
				|			РегистрСведений.ЦеныНоменклатуры.СрезПервых(&ДатаПервыхЦен, ) КАК ЦеныНоменклатурыСрезПервых
				|		ГДЕ
				|			ЦеныНоменклатурыСрезПервых.ТипЦен.Код = ""000000001"") КАК ПолучимПервуюЦену
				|		ПО РеализацияТоваровУслугТовары.ХарактеристикаНоменклатуры = ПолучимПервуюЦену.ХарактеристикаНоменклатуры
				|ГДЕ
				|	РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
				|	И РеализацияТоваровУслугТовары.Ссылка.Проведен
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ВозвратТоваровОтПокупателяТовары.Ссылка,
				|	ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент,
				|	ВозвратТоваровОтПокупателяТовары.Номенклатура,
				|	ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры,
				|	-ВозвратТоваровОтПокупателяТовары.Количество,
				|	-ВозвратТоваровОтПокупателяТовары.Сумма,
				|	-ПолучимЦену.Цена * ВозвратТоваровОтПокупателяТовары.Количество * (1 - (ЕСТЬNULL(ВЫБОР
				|			КОГДА &ПрименятьРучнуюСкидку
				|				ТОГДА ВозвратТоваровОтПокупателяТовары.ПроцентСкидкиНаценки
				|			ИНАЧЕ 0
				|		КОНЕЦ, 0) + ВЫБОР
				|		КОГДА ЕСТЬNULL(ПолучимСкидку.ПроцентСкидкиНаценки, 0) = 0
				|				И ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.ПроцентАвтоматическихСкидок, 0) > 0
				|			ТОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.ПроцентАвтоматическихСкидок, 0)
				|		ИНАЧЕ ЕСТЬNULL(ПолучимСкидку.ПроцентСкидкиНаценки, 0)
				|	КОНЕЦ) / 100),
				|	-ВозвратТоваровОтПокупателяТовары.Сумма + ПолучимЦену.Цена * ВозвратТоваровОтПокупателяТовары.Количество * (1 - (ЕСТЬNULL(ВЫБОР
				|			КОГДА &ПрименятьРучнуюСкидку
				|				ТОГДА ВозвратТоваровОтПокупателяТовары.ПроцентСкидкиНаценки
				|			ИНАЧЕ 0
				|		КОНЕЦ, 0) + ВЫБОР
				|		КОГДА ЕСТЬNULL(ПолучимСкидку.ПроцентСкидкиНаценки, 0) = 0
				|				И ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.ПроцентАвтоматическихСкидок, 0) > 0
				|			ТОГДА ЕСТЬNULL(ВозвратТоваровОтПокупателяТовары.ПроцентАвтоматическихСкидок, 0)
				|		ИНАЧЕ ЕСТЬNULL(ПолучимСкидку.ПроцентСкидкиНаценки, 0)
				|	КОНЕЦ) / 100),
				|	-ВЫБОР
				|		КОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент.Код = ""000004317""
				|			ТОГДА ВЫБОР
				|					КОГДА ВозвратТоваровОтПокупателяТовары.Сумма > 2000
				|						ТОГДА 0.15 * ВозвратТоваровОтПокупателяТовары.Сумма
				|					ИНАЧЕ 0.2 * ВозвратТоваровОтПокупателяТовары.Сумма
				|				КОНЕЦ
				|		ИНАЧЕ ВЫБОР
				|				КОГДА НЕ ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент.комиссия = 0
				|					ТОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.Контрагент.комиссия / 100 * ВозвратТоваровОтПокупателяТовары.Сумма
				|				ИНАЧЕ 0
				|			КОНЕЦ
				|	КОНЕЦ,
				|	NULL,
				|	ВозвратТоваровОтПокупателяТовары.ЗаказПокупателя,
				|	0,
				|	ВозвратТоваровОтПокупателяТовары.ЗаказПокупателя.referrer,
				|	ЗНАЧЕНИЕ(Справочник.РекламныеКампании.ПустаяСсылка)
				|ИЗ
				|	Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
				|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			МАКСИМУМ(ЦеныНоменклатуры.Период) КАК Период,
				|			ЦеныНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|			ВозвратТоваровОтПокупателяТовары.Ссылка КАК Реализация,
				|			ВозвратТоваровОтПокупателяТовары.НомерСтроки КАК НомерСтроки
				|		ИЗ
				|			РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
				|				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
				|				ПО ЦеныНоменклатуры.ТипЦен = ТипыЦенНоменклатуры.Ссылка
				|				ПОЛНОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
				|				ПО (ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры = ЦеныНоменклатуры.ХарактеристикаНоменклатуры)
				|					И (ВЫБОР
				|						КОГДА ВозвратТоваровОтПокупателяТовары.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
				|							ТОГДА ВозвратТоваровОтПокупателяТовары.Ссылка.Дата
				|						ИНАЧЕ ВозвратТоваровОтПокупателяТовары.ЗаказПокупателя.Дата
				|					КОНЕЦ >= ЦеныНоменклатуры.Период)
				|		ГДЕ
				|			ТипыЦенНоменклатуры.Код = ""000000001""
				|		
				|		СГРУППИРОВАТЬ ПО
				|			ЦеныНоменклатуры.ХарактеристикаНоменклатуры,
				|			ВозвратТоваровОтПокупателяТовары.Ссылка,
				|			ВозвратТоваровОтПокупателяТовары.НомерСтроки) КАК ПолучимПериодЦены
				|			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|				ПолучимЦену.ХарактеристикаНоменклатуры КАК Характеристики,
				|				ПолучимЦену.Цена КАК Цена,
				|				ПолучимЦену.Период КАК Период
				|			ИЗ
				|				РегистрСведений.ЦеныНоменклатуры КАК ПолучимЦену
				|					ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыЦенНоменклатуры КАК ТипыЦенНоменклатуры
				|					ПО ПолучимЦену.ТипЦен = ТипыЦенНоменклатуры.Ссылка
				|			ГДЕ
				|				ТипыЦенНоменклатуры.Ссылка = &БазовыйТипЦен) КАК ПолучимЦену
				|			ПО ПолучимПериодЦены.ХарактеристикаНоменклатуры = ПолучимЦену.Характеристики
				|				И ПолучимПериодЦены.Период = ПолучимЦену.Период
				|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка = ПолучимПериодЦены.Реализация
				|			И ВозвратТоваровОтПокупателяТовары.НомерСтроки = ПолучимПериодЦены.НомерСтроки
				|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|			ВозвратТоваровОтПокупателяТовары.Ссылка КАК Реализация,
				|			МАКСИМУМ(СкидкиНаценкиНоменклатуры.Период) КАК Период,
				|			ВозвратТоваровОтПокупателяТовары.НомерСтроки КАК НомерСтроки,
				|			СкидкиНаценкиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
				|		ИЗ
				|			РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры
				|				ПОЛНОЕ СОЕДИНЕНИЕ Документ.ВозвратТоваровОтПокупателя.Товары КАК ВозвратТоваровОтПокупателяТовары
				|				ПО (ВозвратТоваровОтПокупателяТовары.ЗаказПокупателя.Дата = СкидкиНаценкиНоменклатуры.Период)
				|					И (СкидкиНаценкиНоменклатуры.ХарактеристикаНоменклатуры В
				|						(ВЫБРАТЬ
				|							ПолучимХарактеристикуНк.Ссылка КАК ХарактеристикаНк
				|						ИЗ
				|							Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
				|								ЛЕВОЕ СОЕДИНЕНИЕ ВТРостовка КАК ВТРостовка
				|									ПОЛНОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ПолучимХарактеристикуНк
				|									ПО
				|										ВТРостовка.Ростовка.Наименование = ПолучимХарактеристикуНк.Наименование
				|											И ВТРостовка.Характеристика.Владелец.Код = ПолучимХарактеристикуНк.Владелец.Нк
				|								ПО
				|									ХарактеристикиНоменклатуры.Ссылка = ВТРостовка.Характеристика
				|						ГДЕ
				|							ХарактеристикиНоменклатуры.Ссылка = ВозвратТоваровОтПокупателяТовары.ХарактеристикаНоменклатуры))
				|		
				|		СГРУППИРОВАТЬ ПО
				|			СкидкиНаценкиНоменклатуры.ХарактеристикаНоменклатуры,
				|			ВозвратТоваровОтПокупателяТовары.НомерСтроки,
				|			ВозвратТоваровОтПокупателяТовары.Ссылка) КАК ПолучимПериодСкидки
				|			ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
				|				СкидкиНаценкиНоменклатуры.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
				|				СкидкиНаценкиНоменклатуры.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|				СкидкиНаценкиНоменклатуры.Период КАК Период
				|			ИЗ
				|				РегистрСведений.СкидкиНаценкиНоменклатуры КАК СкидкиНаценкиНоменклатуры) КАК ПолучимСкидку
				|			ПО ПолучимПериодСкидки.Период = ПолучимСкидку.Период
				|				И ПолучимПериодСкидки.ХарактеристикаНоменклатуры = ПолучимСкидку.ХарактеристикаНоменклатуры
				|		ПО ВозвратТоваровОтПокупателяТовары.Ссылка = ПолучимПериодСкидки.Реализация
				|			И ВозвратТоваровОтПокупателяТовары.НомерСтроки = ПолучимПериодСкидки.НомерСтроки
				|ГДЕ
				|	ВозвратТоваровОтПокупателяТовары.Ссылка.Дата МЕЖДУ &НачДата И &КонДата
				|	И ВозвратТоваровОтПокупателяТовары.Ссылка.Проведен
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|// Расход на рекламу: строки без номенклатуры и без документа продажи.
				|// Ключ источника здесь тот же, что в referrer заказа («utm_source
				|// utm_campaign»), поэтому группировка по Referrer сводит выручку
				|// и расход одного канала/кампании в одну строку. Кампании без
				|// идентификатора приходят ключом уровня канала («google ads»).
				|ВЫБРАТЬ
				|	ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка),
				|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
				|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка),
				|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
				|	0,
				|	0,
				|	0,
				|	0,
				|	0,
				|	NULL,
				|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
				|	РекламныйРасход.Сумма,
				|	РекламныйРасход.Ключ,
				|	РекламныйРасход.Кампания
				|ИЗ
				|	РегистрСведений.РекламныйРасход КАК РекламныйРасход
				|ГДЕ
				|	РекламныйРасход.Период МЕЖДУ &НачДата И &КонДата
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	Общ.Документ КАК Документ,
				|	Общ.Контрагент КАК Контрагент,
				|	Общ.Номенклатура КАК Номенклатура,
				|	Общ.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
				|	Общ.Количество КАК Количество,
				|	ОКР(Общ.СуммаПродажи / &Курс, 0) КАК СуммаПродажи,
				|	ОКР(Общ.СуммаБазовая / &Курс, 0) КАК СуммаБазовая,
				|	ВЫБОР
				|		КОГДА &СчитатьПоВсейНоменклатуре
				|				ИЛИ Общ.Номенклатура.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
				|			ТОГДА ОКР(Общ.Розница, 0)
				|		ИНАЧЕ 0
				|	КОНЕЦ / &Курс КАК Розница,
				|	Общ.Комиссия / 2 / &Курс КАК Комиссия,
				|	ВЫБОР
				|		КОГДА &СчитатьПоВсейНоменклатуре
				|				ИЛИ Общ.Номенклатура.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
				|			ТОГДА ОКР(Общ.СуммаБазовая * 0.05, 0)
				|		ИНАЧЕ 0
				|	КОНЕЦ / &Курс КАК Проценты,
				|	ВЫБОР
				|		КОГДА &СчитатьПоВсейНоменклатуре
				|				ИЛИ Общ.Номенклатура.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
				|			ТОГДА ОКР(Общ.СуммаБазовая * 0.05 + Общ.Розница + Общ.Комиссия, 0)
				|		ИНАЧЕ 0
				|	КОНЕЦ / &Курс КАК Общий,
				|	ВЫБОР
				|		КОГДА &СчитатьПоВсейНоменклатуре
				|				ИЛИ Общ.Номенклатура.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
				|			ТОГДА ОКР(Общ.СуммаБазовая, 0) - Общ.Цена * 0.7
				|		ИНАЧЕ 0
				|	КОНЕЦ / &Курс КАК Цена,
				|	Общ.Реклама / &Курс КАК Реклама,
				|	(ВЫБОР
				|		КОГДА &СчитатьПоВсейНоменклатуре
				|				ИЛИ Общ.Номенклатура.Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
				|			ТОГДА ОКР(Общ.СуммаБазовая * 0.05 + Общ.Розница + Общ.Комиссия, 0)
				|		ИНАЧЕ 0
				|	КОНЕЦ - Общ.Реклама) / &Курс КАК Прибыль,
				|	Общ.РекламнаяКампания КАК РекламнаяКампания,
				|	Общ.ЗаказПокупателя КАК ЗаказПокупателя,
				|	Общ.КлючИсточника КАК Referrer,
				|	Общ.ЗаказПокупателя.referrerSession КАК ReferrerSession
				|{ВЫБРАТЬ
				|	Документ.*,
				|	Контрагент.*,
				|	Номенклатура.*,
				|	ХарактеристикаНоменклатуры.*,
				|	Количество,
				|	СуммаПродажи,
				|	СуммаБазовая,
				|	Розница,
				|	Комиссия,
				|	Общий,
				|	Проценты,
				|	Цена,
				|	Реклама,
				|	Прибыль,
				|	РекламнаяКампания.*,
				|	ЗаказПокупателя.*,
				|	Referrer,
				|	ReferrerSession}
				|ИЗ
				|	Общ КАК Общ
				|{ГДЕ
				|	Общ.Документ.*,
				|	Общ.Контрагент.*,
				|	Общ.Номенклатура.*,
				|	Общ.ХарактеристикаНоменклатуры.*,
				|	Общ.Количество,
				|	Общ.СуммаПродажи,
				|	Общ.СуммаБазовая,
				|	Общ.Розница,
				|	Общ.Комиссия,
				|	Общ.Реклама,
				|	Общ.РекламнаяКампания.*,
				|	Общ.ЗаказПокупателя.*}
				|{УПОРЯДОЧИТЬ ПО
				|	Документ.*,
				|	Контрагент.*,
				|	Номенклатура.*,
				|	ХарактеристикаНоменклатуры.*,
				|	Количество,
				|	СуммаПродажи,
				|	СуммаБазовая,
				|	Розница,
				|	Комиссия,
				|	Общий,
				|	Цена,
				|	Реклама,
				|	Прибыль,
				|	РекламнаяКампания.*,
				|	ЗаказПокупателя.*,
				|	Referrer,
				|	ReferrerSession}
				|ИТОГИ
				|	СУММА(Количество),
				|	СУММА(СуммаПродажи),
				|	СУММА(СуммаБазовая),
				|	СУММА(Розница),
				|	СУММА(Комиссия),
				|	СУММА(Проценты),
				|	СУММА(Общий),
				|	СУММА(Цена),
				|	СУММА(Реклама),
				|	СУММА(Прибыль)
				|ПО
				|	ОБЩИЕ,
				|	Документ,
				|	Контрагент,
				|	Номенклатура,
				|	ХарактеристикаНоменклатуры
				|{ИТОГИ ПО
				|	Документ.*,
				|	Контрагент.*,
				|	Номенклатура.*,
				|	ХарактеристикаНоменклатуры.*,
				|	Количество,
				|	СуммаПродажи,
				|	СуммаБазовая,
				|	Розница,
				|	Комиссия,
				|	Цена,
				|	Реклама,
				|	Прибыль,
				|	РекламнаяКампания.*,
				|	ЗаказПокупателя.*,
				|	Referrer,
				|	ReferrerSession}";

			
	
	
	
	// В универсальном отчете включен флаг использования свойств и категорий.
	Если УниверсальныйОтчет.ИспользоватьСвойстваИКатегории Тогда
		
		// Добавление свойств и категорий поля запроса в таблицу полей.
		// Необходимо вызывать для каждого поля запроса, предоставляющего возможность использования свойств и категорий.
		
		// УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля(<ПсевдонимТаблицы>.<Поле> , <ПсевдонимПоля>, <Представление>, <Назначение>);
		//УниверсальныйОтчет.ДобавитьСвойстваИКатегорииДляПоля("ИсточникДанных.Номенклатура", "Номенклатура", "Номенклатура", ПланыВидовХарактеристик.НазначенияСвойствКатегорийОбъектов.Справочник_Номенклатура);
		//
		// Добавление свойств и категорий в исходный текст запроса.
		УниверсальныйОтчет.ДобавитьВТекстЗапросаСвойстваИКатегории(ТекстЗапроса);
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	// Инициализация текста запроса построителя отчета
	УниверсальныйОтчет.ПостроительОтчета.Текст = ТекстЗапроса;
	
	// Представления полей отчета.
	// Необходимо вызывать для каждого поля запроса.
	// УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить(<ИмяПоля>, <ПредставлениеПоля>);
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаПродажи", "Сумма продажи");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("СуммаБазовая", "Сумма базовая");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ЗаказПокупателя", "Заказ покупателя");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Referrer", "Referrer");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("ReferrerSession", "Referrer session");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Реклама", "Реклама");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("Прибыль", "Прибыль после рекламы");
	УниверсальныйОтчет.мСтруктураПредставлениеПолей.Вставить("РекламнаяКампания", "Рекламная кампания");
	
	
	// Добавление показателей
	// Необходимо вызывать для каждого добавляемого показателя.
	// УниверсальныйОтчет.ДобавитьПоказатель(<ИмяПоказателя>, <ПредставлениеПоказателя>, <ВключенПоУмолчанию>, <Формат>, <ИмяГруппы>, <ПредставлениеГруппы>);
	
	УниверсальныйОтчет.ДобавитьПоказатель("Количество"  , "Количество"   , Истина, "ЧЦ=10; ЧДЦ=0");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаПродажи", "Сумма продажи", Истина, "ЧЦ=10; ЧДЦ=0", "Сумма", "Сумма");
	УниверсальныйОтчет.ДобавитьПоказатель("СуммаБазовая", "Сумма базовая", Истина, "ЧЦ=10; ЧДЦ=0", "Сумма", "Сумма");
	УниверсальныйОтчет.ДобавитьПоказатель("Общий"       , "Общий"        , Истина, "ЧЦ=10; ЧДЦ=0", "Инфа", "Инфа");
	
	УниверсальныйОтчет.ДобавитьПоказатель("Розница", "Розница"   , Истина, "ЧЦ=10; ЧДЦ=0", "Инфа", "Инфа");
	УниверсальныйОтчет.ДобавитьПоказатель("Комиссия", "Комиссия" , Истина, "ЧЦ=10; ЧДЦ=0"); 
	УниверсальныйОтчет.ДобавитьПоказатель("Цена", "Цена" , Истина, "ЧЦ=10; ЧДЦ=0");
	УниверсальныйОтчет.ДобавитьПоказатель("Проценты", "Проценты" , Истина, "ЧЦ=10; ЧДЦ=0", "Инфа", "Инфа");
	// Расход рекламных кабинетов и прибыль за его вычетом. Строки расхода приходят
	// из регистра РекламныйРасход и садятся на ту же группировку Referrer, что и
	// заказы: ключ расхода собран так же, как источник в заказе
	УниверсальныйОтчет.ДобавитьПоказатель("Реклама", "Реклама" , Истина, "ЧЦ=10; ЧДЦ=0", "Сумма", "Сумма");
	УниверсальныйОтчет.ДобавитьПоказатель("Прибыль", "Прибыль после рекламы" , Истина, "ЧЦ=10; ЧДЦ=0", "Инфа", "Инфа");


		// Добавление предопределенных группировок строк отчета.
	// Необходимо вызывать для каждой добавляемой группировки строки.
	// УниверсальныйОтчет.ДобавитьИзмерениеСтроки(<ПутьКДанным>);                            
	//УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Контрагент");
	//УниверсальныйОтчет.ДобавитьИзмерениеСтроки("Номенклатура");
	
	// Добавление предопределенных группировок колонок отчета.
	// Необходимо вызывать для каждой добавляемой группировки колонки.
	// УниверсальныйОтчет.ДобавитьИзмерениеКолонки(<ПутьКДанным>);
	
	// Добавление предопределенных отборов отчета.
	// Необходимо вызывать для каждого добавляемого отбора.
	// УниверсальныйОтчет.ДобавитьОтбор(<ПутьКДанным>);
	УниверсальныйОтчет.ДобавитьОтбор("Номенклатура");
	УниверсальныйОтчет.ДобавитьОтбор("Контрагент");
	УниверсальныйОтчет.ДобавитьОтбор("ЗаказПокупателя");
	УниверсальныйОтчет.ДобавитьОтбор("Referrer");
	УниверсальныйОтчет.ДобавитьОтбор("ReferrerSession");
	УниверсальныйОтчет.ДобавитьОтбор("РекламнаяКампания");
	
	// Добавление предопределенных полей порядка отчета.
	// Необходимо вызывать для каждого добавляемого поля порядка.
	// УниверсальныйОтчет.ДобавитьПорядок(<ПутьКДанным>);
	
	// Установка связи подчиненных и родительских полей
	// УниверсальныйОтчет.УстановитьСвязьПолей(<ПутьКДанным>, <ПутьКДанным>);
	
	// Установка связи полей и измерений
	// УниверсальныйОтчет.УстановитьСвязьПоляИИзмерения(<ИмяПоля>, <ИмяИзмерения>);
	
	// Установка представлений полей
	УниверсальныйОтчет.УстановитьПредставленияПолей(УниверсальныйОтчет.мСтруктураПредставлениеПолей, УниверсальныйОтчет.ПостроительОтчета);
	
	// Установка типов значений свойств в отборах отчета
	УниверсальныйОтчет.УстановитьТипыЗначенийСвойствДляОтбора();
	
	// Заполнение начальных настроек универсального отчета
	УниверсальныйОтчет.УстановитьНачальныеНастройки(Ложь);
	
	// Добавление дополнительных полей
	// Необходимо вызывать для каждого добавляемого дополнительного поля.
	// УниверсальныйОтчет.ДобавитьДополнительноеПоле(<ПутьКДанным>);
	
КонецПроцедуры // УстановитьНачальныеНастройкиУпр()

// Процедура установки начальных настроек отчета с использованием текста запроса
//
Процедура УстановитьНачальныеНастройки(ДополнительныеПараметры = Неопределено) Экспорт
	
	// Настройка общих параметров универсального отчета
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, ДополнительныеПараметры);
	
	// Содержит название отчета, которое будет выводиться в шапке.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.мНазваниеОтчета = "Название отчета";
	УниверсальныйОтчет.мНазваниеОтчета = СокрЛП(ЭтотОбъект.Метаданные().Синоним);
	
	// Содержит признак необходимости отображения надписи и поля выбора раздела учета в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	УниверсальныйОтчет.мВыбиратьИмяРегистра = Ложь;
	
	// Содержит имя регистра, по метаданным которого будет выполняться заполнение настроек отчета.
	// Тип: Строка.
	// Пример:
	// УниверсальныйОтчет.ИмяРегистра = "ТоварыНаСкладах";
	
	// Содержит значение используемого режима ввода периода.
	// Тип: Число.
	// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
	// Значение по умолчанию: 0
	// Пример:
	// УниверсальныйОтчет.мРежимВводаПериода = 0;
	
	// Содержит признак необходимости вывода отрицательных значений показателей красным цветом.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	УниверсальныйОтчет.ОтрицательноеКрасным = Истина;
	
	// Содержит признак необходимости вывода в отчет общих итогов.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьОбщиеИтоги = Ложь;
	
	// Содержит признак необходимости вывода детальных записей в отчет.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Истина;
	
	// Содержит признак необходимости отображения флага использования свойств и категорий в форме настройки.
	// Тип: Булево.
	// Значение по умолчанию: Истина.
	// Пример:
	// УниверсальныйОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	// Содержит признак использования свойств и категорий при заполнении настроек отчета.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	//УниверсальныйОтчет.ИспользоватьСвойстваИКатегории = Истина;
	
	// Содержит признак использования простой формы настроек отчета без группировок колонок.
	// Тип: Булево.
	// Значение по умолчанию: Ложь.
	// Пример:
	// УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	УниверсальныйОтчет.мРежимФормыНастройкиБезГруппировокКолонок = Истина;
	
	УстановитьНачальныеНастройкиУпр(ДополнительныеПараметры);
КонецПроцедуры // УстановитьНачальныеНастройки()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ОТЧЕТА 
	
// Процедура формирования отчета
//
Процедура СформироватьОтчет(ТабличныйДокумент) Экспорт
	
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("НачДата"              , УниверсальныйОтчет.ДатаНач);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("КонДата"              , КонецДня(УниверсальныйОтчет.ДатаКон));
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("БазовыйТипЦен"        , БазовыйТипЦен);
	//УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить(" "                 , БазовыйТипЦен.ПроцентСкидкиНаценки);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ПрименятьРучнуюСкидку", ПрименятьРучнуюСкидкуКБазовойСумме);
	// Ложь - Розница/Проценты/Общий/Цена считаются только по номенклатуре с незаполненной организацией (как было).
	// Истина - условие по организации снимается, считается по всей номенклатуре.
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("СчитатьПоВсейНоменклатуре", СчитатьПоВсейНоменклатуре);
	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("ТекущаяДата", ТекущаяДата()); 
 	УниверсальныйОтчет.ПостроительОтчета.Параметры.Вставить("Курс",?(Курс = 0,1, Курс)); 

	
	УниверсальныйОтчет.ВыводитьДетальныеЗаписи = Ложь;
	// Перед формирование отчета можно установить необходимые параметры универсального отчета.
	
	УниверсальныйОтчет.СформироватьОтчет(ТабличныйДокумент);

КонецПроцедуры // СформироватьОтчет()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура обработки расшифровки
//
Процедура ОбработкаРасшифровки(Расшифровка, Объект) Экспорт
	
	// Дополнительные параметры в расшифровывающий отчет можно передать
	// посредством инициализации переменной "ДополнительныеПараметры".
	
	ДополнительныеПараметры = УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект);
	УниверсальныйОтчет.ОбработкаРасшифровкиУниверсальногоОтчета(Расшифровка, Объект, ДополнительныеПараметры);
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру для сохранения настроек отчета
//
Процедура СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками) Экспорт
	
	УниверсальныйОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураСНастройками);
	УправлениеОтчетами.СохранитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	
КонецПроцедуры // СформироватьСтруктуруДляСохраненияНастроек()

// Заполняет настройки отчета из структуры сохраненных настроек
//
Функция ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками) Экспорт
	
	УправлениеОтчетами.ВосстановитьРеквизитыОтчета(ЭтотОбъект, СтруктураСНастройками);
	Возврат УниверсальныйОтчет.ВосстановитьНастройкиИзСтруктуры(СтруктураСНастройками, ЭтотОбъект);
	
КонецФункции // ВосстановитьНастройкиИзСтруктуры()

// Содержит значение используемого режима ввода периода.
// Тип: Число.
// Возможные значения: 0 - произвольный период, 1 - на дату, 2 - неделя, 3 - декада, 4 - месяц, 5 - квартал, 6 - полугодие, 7 - год
// Значение по умолчанию: 0
// Пример:
// УниверсальныйОтчет.мРежимВводаПериода = 1;

#КонецЕсли
